package src.main.java.lesson2;
/*
Вывести на экран любую строку с использованием экранирования символа “.
Создать 2 переменные типа String вывести через пробел результат их сложения(конкатенации).
 */
public class Exercise7 {
    public static void main(String[] args) {
        String one ="я первый стринг ";
        System.out.println(one);
        String two = "я второй стринг";
        System.out.println(one+" "+ two);
    }
}